Revit 2027 API
MEPSection.Friction Property
 The friction of the section.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Friction { get; }
Public ReadOnly Property Friction As Double
	Get
public:
property double Friction {
	double get ();
}
member Friction : float with get
Property Value
Double
Remarks
 In one section, all section members have same friction. Default unit is Feet of Water (60 °F) per 100 feet. For Duct, unit type is UT_HVAC_Friction. For Pipe, unit type is UT_Piping_Friction
See Also
Reference
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace